Repository: gersoncl10000/Personal_Website
Catalog: GersonCastillo_Pro/Client/Resources/Shared.*.resx
Languages: es_es

# Skills
source: Skills & Technologies
es_es: Competencias & Tecnologías

source: Work & Projects
es_es: Proyectos de Trabajo

source: Contact
es_es: Contacto

source: Home
es_es: Inicio

source: Introduction
es_es: Introducción

source: Experience
es_es: Experiencia

source: Education
es_es: Educación

source: Portfolio
es_es: Portafolio

source: Language
es_es: Idioma

source: English
es_es: Inglés

source: Spanish
es_es: Español

source: Loading...
es_es: Cargando...

source: Close
es_es: Cerrar

source: Technical Skills
es_es: Habilidades Técnicas

source: Business Skills
es_es: Habilidades Empresariales

# SoftwareLanguages
source: Programming Languages
es_es: Lenguajes de Programación

source: Development Tools
es_es: Herramientas de Desarrollo

# IntroDescription
source: Senior Technology Leader with more than 15 years of proven experience in directing multidisciplinary teams (50+ members), financial strategy, and end-to-end software development. My career is distinguished by the ability to transform complex business challenges into robust, scalable technological solutions with a direct impact on financial performance.
es_es: Líder tecnológico senior con más de 15 años de experiencia probada en la dirección de equipos multidisciplinarios (+50 personas), estrategia financiera y desarrollo de software end-to-end. Mi carrera se define por mi capacidad para traducir complejos desafíos de negocio en soluciones tecnológicas robustas, escalables y con un impacto directo en la cuenta de resultados.

# IntroQuote
source: "Transforming complex business challenges into scalable technology solutions."
es_es: "Transformo desafíos empresariales complejos en soluciones tecnológicas escalables."

source: Business
es_es: Negocios

source: Software Development
es_es: Desarrollo de Software

source: Languages
es_es: Lenguajes

source: .NET Frameworks & Libraries
es_es: Frameworks y Librerías .NET

source: Other Frameworks & Libraries
es_es: Otros Frameworks y Librerías

source: Work
es_es: Trabajo

source: Some projects
es_es: Algunos proyectos

source: Repositories
es_es: Repositorios

source: Current
es_es: Actual

source: Background
es_es: Experiencia

source: Newest Courses & Certifications
es_es: Últimos Cursos y Certificaciones

source: Academic Degrees
es_es: Títulos Académicos

source: Courses & Certifications
es_es: Cursos y Certificaciones

source: Private Repository
es_es: Repositorio Privado

source: Public Repository
es_es: Repositorio Público

source: Web App loading...
es_es: Cargando aplicación web...

# FooterCopyright
source: This website has been developed by Gerson Castillo © {0} Copyright; using
es_es: Este sitio web fue desarrollado por Gerson Castillo © {0} Copyright, usando

# ContactTitle
source: Getting in touch with me
es_es: Ponte en contacto conmigo

# ContactSubtitle
source: Reach out to me through my social media or mail.
es_es: Contáctame a través de mis redes sociales o correo electrónico.

source: Email
es_es: Correo

# FooterText
source: This website has been developed by Gerson Castillo ©{0} Copyright; using
es_es: Este sitio web ha sido desarrollado por Gerson Castillo ©{0} Copyright; usando

# FooterTechStack
source: from ASP.NET Core.
es_es: de ASP.NET Core.

# AppLoading
source: Web App loading...
es_es: Cargando aplicación web...

source: Previous
es_es: Anterior

source: Next
es_es: Siguiente

source: Comments
es_es: Comentarios

source: Files
es_es: Archivos

source: Presentation
es_es: Presentación

# DownloadPowerPoint
source: Download PowerPoint presentation
es_es: Descargar presentación PowerPoint

# PageNotFound
source: Not found
es_es: No encontrado

# PageNotFoundMessage
source: Sorry, there's nothing at this address.
es_es: Lo sentimos, no hay nada en esta dirección.

# PageTitle
source: Gerson Castillo - Financial Consolidation & Automation Specialist
es_es: Gerson Castillo - Especialista en Consolidación Financiera y Automatización

# PageDescription
source: Professional portfolio of Gerson Castillo, specialist in financial consolidation, automation, and software development.
es_es: Portafolio profesional de Gerson Castillo, especialista en consolidación financiera, automatización y desarrollo de software.

# ProfileImageAlt
source: Gerson Castillo Profile Photo
es_es: Foto de perfil de Gerson Castillo

# FlagImageAlt
source: Language selection flag
es_es: Bandera de selección de idioma

source: Language Selector
es_es: Selector de Idioma

source: Main Navigation
es_es: Navegación Principal

# SkipToContent
source: Skip to main content
es_es: Saltar al contenido principal

# BusinessSkillsIntro
source: Key business competencies and leadership qualities
es_es: Competencias empresariales clave y cualidades de liderazgo

# BusinessSkill1
source: Expertise and Advanced Knowledge in Financial Consolidation, Accounting, and Auditing (IFRS, PGC, and NOFCAC)
es_es: Especialización y Conocimiento Avanzado en Consolidación Financiera, Contabilidad y Auditoría (NIIF, PGC y NOFCAC)

# BusinessSkill2
source: Advanced knowledge in financial, investment, and business management.
es_es: Conocimiento avanzado en gestión financiera, de inversiones y empresarial.

# BusinessSkill3
source: Excellent ability for comprehensive risk assessment and development of effective strategies.
es_es: Excelente capacidad para la evaluación integral de riesgos y desarrollo de estrategias efectivas.

# BusinessSkill4
source: Internal controls process automation.
es_es: Automatización de procesos de controles internos.

# BusinessSkill5
source: Financial Reports Automation, ETL & ELT Processes, with Advanced Proficiency in Reporting and Data Modeling Tools such as Power BI and Excel
es_es: Automatización de Reportes Financieros, Procesos ETL y ELT, con Competencia Avanzada en Herramientas de Reporting y Modelado de Datos como Power BI y Excel

# BusinessSkill6
source: Accounting entries automation.
es_es: Automatización de asientos contables.

# BusinessSkill7
source: Bank reconciliation automation.
es_es: Automatización de conciliaciones bancarias.

# BusinessSkill8
source: Payments automation.
es_es: Automatización de pagos.

# BusinessSkill9
source: Data entry Automation.
es_es: Automatización de entrada de datos.

# PersonalProject1Title
source: Presentation of Financial Consolidation Exercise: 2024
es_es: Presentación de Ejercicio de Consolidación Financiera: 2024

# PersonalProject1Description
source: I have prepared a comprehensive financial consolidation exercise utilizing Power BI and DAX functions. This exercise aims to demonstrate the main principles of financial consolidation under the IFRS standards, specifically IAS 21. The final financial reports have been embedded into a web page using Power BI Embedded for seamless access and interaction.
es_es: He preparado un ejercicio integral de consolidación financiera utilizando Power BI y funciones DAX. Este ejercicio tiene como objetivo demostrar los principales principios de consolidación financiera bajo las normas NIIF, específicamente la NIC 21. Los reportes financieros finales han sido integrados en una página web usando Power BI Embedded para acceso e interacción sin problemas.

# PersonalProject1Action
source: I developed the whole exercise.
es_es: Desarrollé todo el ejercicio.

# PersonalProject2Title
source: Personal web page: 2023
es_es: Página web personal: 2023

# PersonalProject2Description
source: Professional web page.
es_es: Página web profesional.

# PersonalProject2Action
source: I developed the whole project.
es_es: Desarrollé todo el proyecto.

# PersonalProject3Description
source: Program to analyze the currency derivatives market.
es_es: Programa para analizar el mercado de derivados de divisas.

# PersonalProject3Action
source: I developed the whole project.
es_es: Desarrollé todo el proyecto.

# EnterpriseProject1Title
source: E-Commerce 2.0 Year: 2021
es_es: E-Commerce 2.0 Año: 2021

# EnterpriseProject1Description
source: The second version of the groceries eCommerce web app was developed to exploit the potential of the latest technologies from Microsoft ASP.NET Core.
es_es: La segunda versión de la aplicación web de eCommerce de comestibles fue desarrollada para aprovechar el potencial de las últimas tecnologías de Microsoft ASP.NET Core.

# EnterpriseProject1Action
source: I was involved in the five steps of software development of the App's financial, accountant, and administrative components. I also taught programming to our team's newest members.
es_es: Participé en los cinco pasos del desarrollo de software de los componentes financieros, contables y administrativos de la App. También enseñé programación a los miembros más nuevos de nuestro equipo.

# EnterpriseProject2Title
source: E-Commerce 1.0 Year: 2019
es_es: E-Commerce 1.0 Año: 2019

# EnterpriseProject2Description
source: Groceries eCommerce web app fully integrated with the ERP SAP Business One to attend to around 40,000 retail customers.
es_es: Aplicación web de eCommerce de comestibles totalmente integrada con el ERP SAP Business One para atender a alrededor de 40,000 clientes minoristas.

# EnterpriseProject2Action
source: My participation comprehended the App's financial and accounting development.
es_es: Mi participación comprendió el desarrollo financiero y contable de la App.

# EnterpriseProject3Title
source: GC Internal Management Software: 2017
es_es: Software de Gestión Interna GC: 2017

# EnterpriseProject3Description
source: Internal software of gestion of logistics and administration process, developed under .NET technology fully integrated with the ERP SAP Business One.
es_es: Software interno de gestión de procesos logísticos y administrativos, desarrollado bajo tecnología .NET totalmente integrado con el ERP SAP Business One.

# EnterpriseProject3Action
source: I participated in developing the accounting, financial and administrative modules.
es_es: Participé en el desarrollo de los módulos contables, financieros y administrativos.

# EnterpriseProject4Title
source: Banking and Accounting automatized: 2016
es_es: Automatización Bancaria y Contable: 2016

# EnterpriseProject4Description
source: Program for automatic management of banking and accounting.
es_es: Programa para la gestión automática de operaciones bancarias y contables.

# EnterpriseProject4Action
source: I developed the whole project.
es_es: Desarrollé todo el proyecto.

# CurrentJob1Title1
source: Customer Success Manager
es_es: Gerente de Éxito del Cliente

# CurrentJob1Title2
source: (Consolidation specialist)
es_es: (Especialista en Consolidación)

# CurrentJob1Period
source: Konsolidator Iberia · Full-Time 2024 - Feb 2025
es_es: Konsolidator Iberia · Tiempo Completo 2024 - Presente

# CurrentJob1Location
source: Madrid, Comunidad de Madrid, Spain · On-Site
es_es: Madrid, Comunidad de Madrid, España · Presencial

# CurrentJob1Responsibility1
source: Expert in Financial Consolidation: Proficient in managing and optimizing financial consolidation processes.
es_es: Experto en Consolidación Financiera: Competente en la gestión y optimización de procesos de consolidación financiera.

# CurrentJob1Responsibility2
source: Product Specialist: In-depth knowledge of product functionalities and applications.
es_es: Especialista en Producto: Conocimiento profundo de funcionalidades y aplicaciones del producto.

# CurrentJob1Responsibility3
source: Financial Statement Analysis Specialist: Experienced in analyzing and interpreting financial statements for accurate reporting.
es_es: Especialista en Análisis de Estados Financieros: Experimentado en analizar e interpretar estados financieros para reportes precisos.

# CurrentJob1Responsibility4
source: Accounting and Auditing Specialist: Expert in PGC, NOFCAC, IFRS, and IAS standards, ensuring compliance and accuracy.
es_es: Especialista en Contabilidad y Auditoría: Experto en estándares PGC, NOFCAC, NIIF e NIC, asegurando cumplimiento y precisión.

# CurrentJob1Responsibility5
source: Financial Reporting and Business Intelligence Specialist: Advanced skills in Power BI, Advanced Excel, SQL, and M Language for robust financial reporting and analysis.
es_es: Especialista en Reportes Financieros e Inteligencia de Negocios: Habilidades avanzadas en Power BI, Excel Avanzado, SQL y Lenguaje M para reportes financieros y análisis robustos.

# CurrentJob1Responsibility6
source: Automation Solutions Developer: Proficient in creating automation solutions using REST API, .Net Core, and SQL Server to streamline processes and enhance efficiency.
es_es: Desarrollador de Soluciones de Automatización: Competente en crear soluciones de automatización usando REST API, .Net Core y SQL Server para optimizar procesos y mejorar la eficiencia.

# CurrentJob2Title1
source: Managing Partner | Redemerca, LLC (Private Investment Company)
es_es: Propietario de negocio

# CurrentJob2Period
source: Aug. 2019 - Present
es_es: Redemerca LLC 2019-Presente

# CurrentJob2Responsibility1
source: Cofounder and accountable for the technology and analytics strategy to manage a private investment portfolio in stocks, options, and futures.
es_es: Gestión de portafolio de inversiones. (Acciones, Opciones y Futuros).

# CurrentJob2Responsibility2
source: Financial Technology (Fintech) Development: Designed and built from scratch a proprietary platform with ASP.NET Core, Python (NumPy, Pandas), and SQL for investment analysis and management.
es_es: Análisis de mercado y empresas.

# CurrentJob2Responsibility3
source: Applied Data Science: Implemented predictive models to analyze market trends, evaluate investment opportunities, and automate strategic decision-making.
es_es: Desarrollo de software enfocado en análisis de mercado.

# PastJob1Title1
source: Director of Finance And Administration
es_es: Director de Finanzas y Administración

# PastJob1Period
source: Marluis Investments 2006-2022
es_es: Marluis Inversiones 2006-2022

# PastJob1Responsibility1
source: Management of the accounting, auditing, financial, administrative, and human resources areas.
es_es: Gestión de las áreas contable, auditoría, financiera, administrativa y de recursos humanos.

# PastJob1Responsibility2
source: Modeling and preparation of financial statements under IFRS standards.
es_es: Modelado y preparación de estados financieros bajo estándares NIIF.

# PastJob1Responsibility3
source: Development of investment plans and strategies, budgets, and tax planning.
es_es: Desarrollo de planes y estrategias de inversión, presupuestos y planificación fiscal.

# PastJob1Responsibility4
source: Supervision of administrative and accounting processes, internal auditing, internal control, and personnel management.
es_es: Supervisión de procesos administrativos y contables, auditoría interna, control interno y gestión de personal.

# PastJob1Responsibility5
source: Software development and management of financial operations automation processes.
es_es: Desarrollo de software y gestión de procesos de automatización de operaciones financieras.

# PastJob1Responsibility6
source: Development of ETL and ELT processes, ASP.NET Core, SQL Server, Power BI, Power Query, DAX.
es_es: Desarrollo de procesos ETL y ELT, ASP.NET Core, SQL Server, Power BI, Power Query, DAX.

# PastJob1Responsibility7
source: Financial and accounting integration of internal software developments with the ERP system SAP Business One.
es_es: Integración financiera y contable de desarrollos de software internos con el sistema ERP SAP Business One.

# AcademicDegree1
source: English for Academic Purposes (LEAP)
es_es: Inglés para Propósitos Académicos (LEAP)

# AcademicDegree2
source: Business English Certificate
es_es: Certificado de Inglés Empresarial

# AcademicDegree3
source: Law Degree
es_es: Abogado

# AcademicDegree4
source: Bachelor’s Degree in Public Accounting
es_es: Licenciatura en Contaduría Pública

# AIDataScience
source: Artificial Intelligence & Data Science
es_es: Inteligencia Artificial y Ciencia de Datos
